In [8]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [9]:
ages = list(range(0,90,10))
df =titanic
for x in ages:
    start = x
    end = x+ 10
    ageTemp = df[(titanic['age'] >= start)&(titanic['age'] < end)]
    print("{}세 이상 - {}세 미만 사망자수 : {}".format(start,end,(ageTemp['survived']).count()))

0세 이상 - 10세 미만 사망자수 : 62
10세 이상 - 20세 미만 사망자수 : 102
20세 이상 - 30세 미만 사망자수 : 220
30세 이상 - 40세 미만 사망자수 : 167
40세 이상 - 50세 미만 사망자수 : 89
50세 이상 - 60세 미만 사망자수 : 48
60세 이상 - 70세 미만 사망자수 : 19
70세 이상 - 80세 미만 사망자수 : 6
80세 이상 - 90세 미만 사망자수 : 1

In [87]:
ages = list(range(0,90,10))
df =titanic
for x in ages:
    start = x
    end = x+ 10
    ageTemp = df[(titanic['age'] >= start)&(titanic['age'] < end)]
    print("{}세 이상 - {}세 미만 사망자수 : {}".format(start,end,(ageTemp['sex'][ageTemp['survived']==0].count())))

0세 이상 - 10세 미만 사망자수 : 24
10세 이상 - 20세 미만 사망자수 : 61
20세 이상 - 30세 미만 사망자수 : 143
30세 이상 - 40세 미만 사망자수 : 94
40세 이상 - 50세 미만 사망자수 : 55
50세 이상 - 60세 미만 사망자수 : 28
60세 이상 - 70세 미만 사망자수 : 13
70세 이상 - 80세 미만 사망자수 : 6
80세 이상 - 90세 미만 사망자수 : 0

In [60]:
    titanic['survived'].unique()

array([0, 1], dtype=int64)

In [52]:
titanic['sex'].unique()
&(titanic['survived'] == 0 )

array(['male', 'female'], dtype=object)

In [89]:
ages = list(range(0,90,10))
df =titanic
for x in ages:
    start = x
    end = x+ 10
    ageTemp = df[(titanic['age'] >= start)&(titanic['age'] < end)]
    print("{}세 이상 - {}세 미만 사망자수 : {}".format(start,end,(ageTemp.groupby('sex')['survived']).count()))
    print("")
    print("="*80)

0세 이상 - 10세 미만 사망자수 : sex
female    30
male      32
Name: survived, dtype: int64

================================================================================
10세 이상 - 20세 미만 사망자수 : sex
female    45
male      57
Name: survived, dtype: int64

================================================================================
20세 이상 - 30세 미만 사망자수 : sex
female     72
male      148
Name: survived, dtype: int64

================================================================================
30세 이상 - 40세 미만 사망자수 : sex
female     60
male      107
Name: survived, dtype: int64

================================================================================
40세 이상 - 50세 미만 사망자수 : sex
female    32
male      57
Name: survived, dtype: int64

================================================================================
50세 이상 - 60세 미만 사망자수 : sex
female    18
male      30
Name: survived, dtype: int64

================================================================================
60세 이상 - 70세 미만 사망자수 : sex
female     4
male      15
Name: survived, dtype: int64

================================================================================
70세 이상 - 80세 미만 사망자수 : sex
male    6
Name: survived, dtype: int64

================================================================================
80세 이상 - 90세 미만 사망자수 : sex
male    1
Name: survived, dtype: int64

================================================================================

In [100]:
ages = list(range(0,90,10))

for x in ages:
    start = x # 
    end = x + 10
    ageTemp = titanic[(titanic['age'] >= start) &(titanic['age'] < end)]
    print(ageTemp['sex'][ageTemp['survived']==0].count(),ageTemp['sex'][ageTemp['survived']==1].count()) #반증할려고 할흔적
    print("{}세이상 - {}세 미만 사망자수 :{}".format(start,end,(ageTemp.groupby('sex')['survived']).count()))
di = ageTemp.groupby('sex')['survived'] == 0
print(di)

24 38
0세이상 - 10세 미만 사망자수 :sex
female    30
male      32
Name: survived, dtype: int64
61 41
10세이상 - 20세 미만 사망자수 :sex
female    45
male      57
Name: survived, dtype: int64
143 77
20세이상 - 30세 미만 사망자수 :sex
female     72
male      148
Name: survived, dtype: int64
94 73
30세이상 - 40세 미만 사망자수 :sex
female     60
male      107
Name: survived, dtype: int64
55 34
40세이상 - 50세 미만 사망자수 :sex
female    32
male      57
Name: survived, dtype: int64
28 20
50세이상 - 60세 미만 사망자수 :sex
female    18
male      30
Name: survived, dtype: int64
13 6
60세이상 - 70세 미만 사망자수 :sex
female     4
male      15
Name: survived, dtype: int64
6 0
70세이상 - 80세 미만 사망자수 :sex
male    6
Name: survived, dtype: int64
0 1
80세이상 - 90세 미만 사망자수 :sex
male    1
Name: survived, dtype: int64
False

In [6]:
print("{1}세이상 - {0}세 미만 사망자수 :{2}".format(1,2,3)) #{}:이 딕셔너리는 인덱스 값으로 받음 뒤에 포맷형식으로부터

print("{a}세이상 - {c}세 미만 사망자수 :{b}".format(a=1,b=2,c=3))

2세이상 - 1세 미만 사망자수 :3
1세이상 - 3세 미만 사망자수 :2

In [12]:
titanic.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [20]:
print(type(titanic[['age','pclass']]))

<class 'pandas.core.frame.DataFrame'>